Public Member Functions | Public Attributes | List of all members
API_MarkUpCommentType Struct Reference
Issue management
Represents a comment attached to a Mark-Up entry. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_MarkUpCommentType (GS::UniString author=GS::UniString(), GS::UniString text=GS::UniString(), API_MarkUpCommentStatusID status=APIComment_Unknown)
 Public Attributes
API_Guid  | guid
Identifier of the comment.
GS::UniString  | author
The author of the comment.
GS::UniString  | text
Text of the comment.
API_MarkUpCommentStatusID  | status
Status. See API_MarkUpCommentStatusID for further info.
GSTime  | creaTime
Creation time.
Detailed Description
Represents a comment attached to a Mark-Up entry.
Remarks
Comment can be added with ACAPI_Markup_AddComment function to an existing Mark-Up entry and the list of the comments can be retrieved using ACAPI_Markup_GetComments.
Constructor & Destructor Documentation
◆ API_MarkUpCommentType()
 API_MarkUpCommentType::API_MarkUpCommentType  |  ( |  GS::UniString  |  author = GS::UniString (),
|  GS::UniString  |  text = GS::UniString (),
|  API_MarkUpCommentStatusID  |  status = APIComment_Unknown
)
inline
Member Data Documentation
◆ author
 API_MarkUpCommentType::author
The author of the comment.
◆ creaTime
 API_MarkUpCommentType::creaTime
Creation time.
◆ guid
 API_MarkUpCommentType::guid
Identifier of the comment.
◆ status
 API_MarkUpCommentType::status
Status. See API_MarkUpCommentStatusID for further info.
◆ text
 API_MarkUpCommentType::text
Text of the comment.